briancostabile/tiva-bsp/source/bsp/processor/tm4c123/bsp_Gpio_tm4c123.h
#define BSP_GPIO_PORT_ID_PC5          2
#define BSP_GPIO_BASE_ADDR_PC5        GPIO_PORTC_BASE
#define BSP_GPIO_BIT_OFFSET_PC5       5
#define BSP_GPIO_BIT_MASK_PC5         (0x00000001 << BSP_GPIO_BIT_OFFSET_PC5)

#define BSP_GPIO_PORT_ID_PC6           2
#define BSP_GPIO_BASE_ADDR_PC6         GPIO_PORTC_BASE
#define BSP_GPIO_BIT_OFFSET_PC6        6
#define BSP_GPIO_BIT_MASK_PC6          (0x00000001 << BSP_GPIO_BIT_OFFSET_PC6)

#define BSP_GPIO_PORT_ID_PC7           2
#define BSP_GPIO_BASE_ADDR_PC7         GPIO_PORTC_BASE
#define BSP_GPIO_BIT_OFFSET_PC7        7
#define BSP_GPIO_BIT_MASK_PC7          (0x00000001 << BSP_GPIO_BIT_OFFSET_PC7)


/* Port D */
#define BSP_GPIO_PORT_ID_PD0           3
#define BSP_GPIO_BASE_ADDR_PD0         GPIO_PORTD_BASE
#define BSP_GPIO_BIT_OFFSET_PD0        0
#define BSP_GPIO_BIT_MASK_PD0          (0x00000001 << BSP_GPIO_BIT_OFFSET_PD0)

#define BSP_GPIO_PORT_ID_PD1           3
#define BSP_GPIO_BASE_ADDR_PD1         GPIO_PORTD_BASE
#define BSP_GPIO_BIT_OFFSET_PD1        1
#define BSP_GPIO_BIT_MASK_PD1          (0x00000001 << BSP_GPIO_BIT_OFFSET_PD1)

#define BSP_GPIO_PORT_ID_PD2           3
#define BSP_GPIO_BASE_ADDR_PD2         GPIO_PORTD_BASE
#define BSP_GPIO_BIT_OFFSET_PD2        2
#define BSP_GPIO_BIT_MASK_PD2          (0x00000001 << BSP_GPIO_BIT_OFFSET_PD2)

#define BSP_GPIO_PORT_ID_PD3           3
#define BSP_GPIO_BASE_ADDR_PD3         GPIO_PORTD_BASE
#define BSP_GPIO_BIT_OFFSET_PD3        3
#define BSP_GPIO_BIT_MASK_PD3          (0x00000001 << BSP_GPIO_BIT_OFFSET_PD3)

#define BSP_GPIO_PORT_ID_PD4           3
#define BSP_GPIO_BASE_ADDR_PD4         GPIO_PORTD_BASE
#define BSP_GPIO_BIT_OFFSET_PD4        4
#define BSP_GPIO_BIT_MASK_PD4          (0x00000001 << BSP_GPIO_BIT_OFFSET_PD4)

#define BSP_GPIO_PORT_ID_PD5           3
#define BSP_GPIO_BASE_ADDR_PD5         GPIO_PORTD_BASE
#define BSP_GPIO_BIT_OFFSET_PD5        5
#define BSP_GPIO_BIT_MASK_PD5          (0x00000001 << BSP_GPIO_BIT_OFFSET_PD5)

#define BSP_GPIO_PORT_ID_PD6           3
#define BSP_GPIO_BASE_ADDR_PD6         GPIO_PORTD_BASE
#define BSP_GPIO_BIT_OFFSET_PD6        6
#define BSP_GPIO_BIT_MASK_PD6          (0x00000001 << BSP_GPIO_BIT_OFFSET_PD6)

#define BSP_GPIO_PORT_ID_PD7           3
#define BSP_GPIO_BASE_ADDR_PD7         GPIO_PORTD_BASE
#define BSP_GPIO_BIT_OFFSET_PD7        7
#define BSP_GPIO_BIT_MASK_PD7          (0x00000001 << BSP_GPIO_BIT_OFFSET_PD7)


/* Port E */
#define BSP_GPIO_PORT_ID_PE0           4
#define BSP_GPIO_BASE_ADDR_PE0         GPIO_PORTE_BASE
#define BSP_GPIO_BIT_OFFSET_PE0        0
#define BSP_GPIO_BIT_MASK_PE0          (0x00000001 << BSP_GPIO_BIT_OFFSET_PE0)

#define BSP_GPIO_PORT_ID_PE1           4
#define BSP_GPIO_BASE_ADDR_PE1         GPIO_PORTE_BASE
#define BSP_GPIO_BIT_OFFSET_PE1        1
#define BSP_GPIO_BIT_MASK_PE1          (0x00000001 << BSP_GPIO_BIT_OFFSET_PE1)

#define BSP_GPIO_PORT_ID_PE2           4
#define BSP_GPIO_BASE_ADDR_PE2         GPIO_PORTE_BASE
#define BSP_GPIO_BIT_OFFSET_PE2        2
#define BSP_GPIO_BIT_MASK_PE2          (0x00000001 << BSP_GPIO_BIT_OFFSET_PE2)

#define BSP_GPIO_PORT_ID_PE3           4
#define BSP_GPIO_BASE_ADDR_PE3         GPIO_PORTE_BASE
#define BSP_GPIO_BIT_OFFSET_PE3        3
#define BSP_GPIO_BIT_MASK_PE3          (0x00000001 << BSP_GPIO_BIT_OFFSET_PE3)

#define BSP_GPIO_PORT_ID_PE4           4
#define BSP_GPIO_BASE_ADDR_PE4         GPIO_PORTE_BASE
#define BSP_GPIO_BIT_OFFSET_PE4        4
#define BSP_GPIO_BIT_MASK_PE4          (0x00000001 << BSP_GPIO_BIT_OFFSET_PE4)

#define BSP_GPIO_PORT_ID_PE5           4
#define BSP_GPIO_BASE_ADDR_PE5         GPIO_PORTE_BASE
#define BSP_GPIO_BIT_OFFSET_PE5        5
#define BSP_GPIO_BIT_MASK_PE5          (0x00000001 << BSP_GPIO_BIT_OFFSET_PE5)

#define BSP_GPIO_PORT_ID_PE6           4
#define BSP_GPIO_BASE_ADDR_PE6         GPIO_PORTE_BASE
#define BSP_GPIO_BIT_OFFSET_PE6        6
#define BSP_GPIO_BIT_MASK_PE6          (0x00000001 << BSP_GPIO_BIT_OFFSET_PE6)

#define BSP_GPIO_PORT_ID_PE7           4
#define BSP_GPIO_BASE_ADDR_PE7         GPIO_PORTE_BASE
#define BSP_GPIO_BIT_OFFSET_PE7        5
#define BSP_GPIO_BIT_MASK_PE7          (0x00000001 << BSP_GPIO_BIT_OFFSET_PE7)


/* Port F */
#define BSP_GPIO_PORT_ID_PF0           5
#define BSP_GPIO_BASE_ADDR_PF0         GPIO_PORTF_BASE
#define BSP_GPIO_BIT_OFFSET_PF0        0
#define BSP_GPIO_BIT_MASK_PF0          (0x00000001 << BSP_GPIO_BIT_OFFSET_PF0)

#define BSP_GPIO_PORT_ID_PF1           5
#define BSP_GPIO_BASE_ADDR_PF1         GPIO_PORTF_BASE
#define BSP_GPIO_BIT_OFFSET_PF1        1
#define BSP_GPIO_BIT_MASK_PF1          (0x00000001 << BSP_GPIO_BIT_OFFSET_PF1)

#define BSP_GPIO_PORT_ID_PF2           5
#define BSP_GPIO_BASE_ADDR_PF2         GPIO_PORTF_BASE
#define BSP_GPIO_BIT_OFFSET_PF2        2
#define BSP_GPIO_BIT_MASK_PF2          (0x00000001 << BSP_GPIO_BIT_OFFSET_PF2)

#define BSP_GPIO_PORT_ID_PF3           5
#define BSP_GPIO_BASE_ADDR_PF3         GPIO_PORTF_BASE
#define BSP_GPIO_BIT_OFFSET_PF3        3
#define BSP_GPIO_BIT_MASK_PF3          (0x00000001 << BSP_GPIO_BIT_OFFSET_PF3)

#define BSP_GPIO_PORT_ID_PF4           5
#define BSP_GPIO_BASE_ADDR_PF4         GPIO_PORTF_BASE
#define BSP_GPIO_BIT_OFFSET_PF4        4
#define BSP_GPIO_BIT_MASK_PF4          (0x00000001 << BSP_GPIO_BIT_OFFSET_PF4)

#define BSP_GPIO_PORT_ID_PF5           5
#define BSP_GPIO_BASE_ADDR_PF5         GPIO_PORTF_BASE
#define BSP_GPIO_BIT_OFFSET_PF5        5
#define BSP_GPIO_BIT_MASK_PF5          (0x00000001 << BSP_GPIO_BIT_OFFSET_PF5)

#define BSP_GPIO_PORT_ID_PF6           5
#define BSP_GPIO_BASE_ADDR_PF6         GPIO_PORTF_BASE
#define BSP_GPIO_BIT_OFFSET_PF6        6
#define BSP_GPIO_BIT_MASK_PF6          (0x00000001 << BSP_GPIO_BIT_OFFSET_PF6)

#define BSP_GPIO_PORT_ID_PF7           5
#define BSP_GPIO_BASE_ADDR_PF7         GPIO_PORTF_BASE
#define BSP_GPIO_BIT_OFFSET_PF7        7
#define BSP_GPIO_BIT_MASK_PF7          (0x00000001 << BSP_GPIO_BIT_OFFSET_PF7)

