briancostabile/tiva-bsp/source/bsp/processor/tm4c123/bsp_Gpio_tm4c123.h
#define BSP_GPIO_PORT_ID_PK6           9
#define BSP_GPIO_BASE_ADDR_PK6         GPIO_PORTK_BASE
#define BSP_GPIO_BIT_OFFSET_PK6        6
#define BSP_GPIO_BIT_MASK_PK6          (0x00000001 << BSP_GPIO_BIT_OFFSET_PK6)

#define BSP_GPIO_PORT_ID_PK7           9
#define BSP_GPIO_BASE_ADDR_PK7         GPIO_PORTK_BASE
#define BSP_GPIO_BIT_OFFSET_PK7        7
#define BSP_GPIO_BIT_MASK_PK7          (0x00000001 << BSP_GPIO_BIT_OFFSET_PK7)


/* Port L */
#define BSP_GPIO_PORT_ID_PL0           10
#define BSP_GPIO_BASE_ADDR_PL0         GPIO_PORTL_BASE
#define BSP_GPIO_BIT_OFFSET_PL0        0
#define BSP_GPIO_BIT_MASK_PL0          (0x00000001 << BSP_GPIO_BIT_OFFSET_PL0)

#define BSP_GPIO_PORT_ID_PL1           10
#define BSP_GPIO_BASE_ADDR_PL1         GPIO_PORTL_BASE
#define BSP_GPIO_BIT_OFFSET_PL1        1
#define BSP_GPIO_BIT_MASK_PL1          (0x00000001 << BSP_GPIO_BIT_OFFSET_PL1)

#define BSP_GPIO_PORT_ID_PL2           10
#define BSP_GPIO_BASE_ADDR_PL2         GPIO_PORTL_BASE
#define BSP_GPIO_BIT_OFFSET_PL2        2
#define BSP_GPIO_BIT_MASK_PL2          (0x00000001 << BSP_GPIO_BIT_OFFSET_PL2)

#define BSP_GPIO_PORT_ID_PL3           10
#define BSP_GPIO_BASE_ADDR_PL3         GPIO_PORTL_BASE
#define BSP_GPIO_BIT_OFFSET_PL3        3
#define BSP_GPIO_BIT_MASK_PL3          (0x00000001 << BSP_GPIO_BIT_OFFSET_PL3)

#define BSP_GPIO_PORT_ID_PL4           10
#define BSP_GPIO_BASE_ADDR_PL4         GPIO_PORTL_BASE
#define BSP_GPIO_BIT_OFFSET_PL4        4
#define BSP_GPIO_BIT_MASK_PL4          (0x00000001 << BSP_GPIO_BIT_OFFSET_PL4)

#define BSP_GPIO_PORT_ID_PL5           10
#define BSP_GPIO_BASE_ADDR_PL5         GPIO_PORTL_BASE
#define BSP_GPIO_BIT_OFFSET_PL5        5
#define BSP_GPIO_BIT_MASK_PL5          (0x00000001 << BSP_GPIO_BIT_OFFSET_PL5)

#define BSP_GPIO_PORT_ID_PL6           10
#define BSP_GPIO_BASE_ADDR_PL6         GPIO_PORTL_BASE
#define BSP_GPIO_BIT_OFFSET_PL6        6
#define BSP_GPIO_BIT_MASK_PL6          (0x00000001 << BSP_GPIO_BIT_OFFSET_PL6)

#define BSP_GPIO_PORT_ID_PL7           10
#define BSP_GPIO_BASE_ADDR_PL7         GPIO_PORTL_BASE
#define BSP_GPIO_BIT_OFFSET_PL7        7
#define BSP_GPIO_BIT_MASK_PL7          (0x00000001 << BSP_GPIO_BIT_OFFSET_PL7)


/* Port M */
#define BSP_GPIO_PORT_ID_PM0           11
#define BSP_GPIO_BASE_ADDR_PM0         GPIO_PORTM_BASE
#define BSP_GPIO_BIT_OFFSET_PM0        0
#define BSP_GPIO_BIT_MASK_PM0          (0x00000001 << BSP_GPIO_BIT_OFFSET_PM0)

#define BSP_GPIO_PORT_ID_PM1           11
#define BSP_GPIO_BASE_ADDR_PM1         GPIO_PORTM_BASE
#define BSP_GPIO_BIT_OFFSET_PM1        1
#define BSP_GPIO_BIT_MASK_PM1          (0x00000001 << BSP_GPIO_BIT_OFFSET_PM1)

#define BSP_GPIO_PORT_ID_PM2           11
#define BSP_GPIO_BASE_ADDR_PM2         GPIO_PORTM_BASE
#define BSP_GPIO_BIT_OFFSET_PM2        2
#define BSP_GPIO_BIT_MASK_PM2          (0x00000001 << BSP_GPIO_BIT_OFFSET_PM2)

#define BSP_GPIO_PORT_ID_PM3           11
#define BSP_GPIO_BASE_ADDR_PM3         GPIO_PORTM_BASE
#define BSP_GPIO_BIT_OFFSET_PM3        3
#define BSP_GPIO_BIT_MASK_PM3          (0x00000001 << BSP_GPIO_BIT_OFFSET_PM3)

#define BSP_GPIO_PORT_ID_PM4           11
#define BSP_GPIO_BASE_ADDR_PM4         GPIO_PORTM_BASE
#define BSP_GPIO_BIT_OFFSET_PM4        4
#define BSP_GPIO_BIT_MASK_PM4          (0x00000001 << BSP_GPIO_BIT_OFFSET_PM4)

#define BSP_GPIO_PORT_ID_PM5           11
#define BSP_GPIO_BASE_ADDR_PM5         GPIO_PORTM_BASE
#define BSP_GPIO_BIT_OFFSET_PM5        5
#define BSP_GPIO_BIT_MASK_PM5          (0x00000001 << BSP_GPIO_BIT_OFFSET_PM5)

#define BSP_GPIO_PORT_ID_PM6           11
#define BSP_GPIO_BASE_ADDR_PM6         GPIO_PORTM_BASE
#define BSP_GPIO_BIT_OFFSET_PM6        6
#define BSP_GPIO_BIT_MASK_PM6          (0x00000001 << BSP_GPIO_BIT_OFFSET_PM6)

#define BSP_GPIO_PORT_ID_PM7           11
#define BSP_GPIO_BASE_ADDR_PM7         GPIO_PORTM_BASE
#define BSP_GPIO_BIT_OFFSET_PM7        7
#define BSP_GPIO_BIT_MASK_PM7          (0x00000001 << BSP_GPIO_BIT_OFFSET_PM7)


/* Port N */
#define BSP_GPIO_PORT_ID_PN0           12
#define BSP_GPIO_BASE_ADDR_PN0         GPIO_PORTN_BASE
#define BSP_GPIO_BIT_OFFSET_PN0        0
#define BSP_GPIO_BIT_MASK_PN0          (0x00000001 << BSP_GPIO_BIT_OFFSET_PN0)

#define BSP_GPIO_PORT_ID_PN1           12
#define BSP_GPIO_BASE_ADDR_PN1         GPIO_PORTN_BASE
#define BSP_GPIO_BIT_OFFSET_PN1        1
#define BSP_GPIO_BIT_MASK_PN1          (0x00000001 << BSP_GPIO_BIT_OFFSET_PN1)

#define BSP_GPIO_PORT_ID_PN2           12
#define BSP_GPIO_BASE_ADDR_PN2         GPIO_PORTN_BASE
#define BSP_GPIO_BIT_OFFSET_PN2        2
#define BSP_GPIO_BIT_MASK_PN2          (0x00000001 << BSP_GPIO_BIT_OFFSET_PN2)

#define BSP_GPIO_PORT_ID_PN3           12
#define BSP_GPIO_BASE_ADDR_PN3         GPIO_PORTN_BASE
#define BSP_GPIO_BIT_OFFSET_PN3        3
#define BSP_GPIO_BIT_MASK_PN3          (0x00000001 << BSP_GPIO_BIT_OFFSET_PN3)

#define BSP_GPIO_PORT_ID_PN4           12
#define BSP_GPIO_BASE_ADDR_PN4         GPIO_PORTN_BASE
#define BSP_GPIO_BIT_OFFSET_PN4        4
#define BSP_GPIO_BIT_MASK_PN4          (0x00000001 << BSP_GPIO_BIT_OFFSET_PN4)

#define BSP_GPIO_PORT_ID_PN5           12
#define BSP_GPIO_BASE_ADDR_PN5         GPIO_PORTN_BASE
#define BSP_GPIO_BIT_OFFSET_PN5        5
#define BSP_GPIO_BIT_MASK_PN5          (0x00000001 << BSP_GPIO_BIT_OFFSET_PN5)

#define BSP_GPIO_PORT_ID_PN6           12
#define BSP_GPIO_BASE_ADDR_PN6         GPIO_PORTN_BASE
#define BSP_GPIO_BIT_OFFSET_PN6        6
#define BSP_GPIO_BIT_MASK_PN6          (0x00000001 << BSP_GPIO_BIT_OFFSET_PN6)

#define BSP_GPIO_PORT_ID_PN7           12
#define BSP_GPIO_BASE_ADDR_PN7         GPIO_PORTN_BASE
#define BSP_GPIO_BIT_OFFSET_PN7        7
#define BSP_GPIO_BIT_MASK_PN7          (0x00000001 << BSP_GPIO_BIT_OFFSET_PN7)


/* Port P */
#define BSP_GPIO_PORT_ID_PP0           13
#define BSP_GPIO_BASE_ADDR_PP0         GPIO_PORTP_BASE
#define BSP_GPIO_BIT_OFFSET_PP0        0
#define BSP_GPIO_BIT_MASK_PP0          (0x00000001 << BSP_GPIO_BIT_OFFSET_PP0)

#define BSP_GPIO_PORT_ID_PP1           13
#define BSP_GPIO_BASE_ADDR_PP1         GPIO_PORTP_BASE
#define BSP_GPIO_BIT_OFFSET_PP1        1
#define BSP_GPIO_BIT_MASK_PP1          (0x00000001 << BSP_GPIO_BIT_OFFSET_PP1)

