briancostabile/tiva-bsp/source/bsp/processor/tm4c123/bsp_Gpio_tm4c123.h
#define BSP_GPIO_PORT_ID_PP2           13
#define BSP_GPIO_BASE_ADDR_PP2         GPIO_PORTP_BASE
#define BSP_GPIO_BIT_OFFSET_PP2        2
#define BSP_GPIO_BIT_MASK_PP2          (0x00000001 << BSP_GPIO_BIT_OFFSET_PP2)

#define BSP_GPIO_PORT_ID_PP3           13
#define BSP_GPIO_BASE_ADDR_PP3         GPIO_PORTP_BASE
#define BSP_GPIO_BIT_OFFSET_PP3        3
#define BSP_GPIO_BIT_MASK_PP3          (0x00000001 << BSP_GPIO_BIT_OFFSET_PP3)

#define BSP_GPIO_PORT_ID_PP4           13
#define BSP_GPIO_BASE_ADDR_PP4         GPIO_PORTP_BASE
#define BSP_GPIO_BIT_OFFSET_PP4        4
#define BSP_GPIO_BIT_MASK_PP4          (0x00000001 << BSP_GPIO_BIT_OFFSET_PP4)

#define BSP_GPIO_PORT_ID_PP5           13
#define BSP_GPIO_BASE_ADDR_PP5         GPIO_PORTP_BASE
#define BSP_GPIO_BIT_OFFSET_PP5        5
#define BSP_GPIO_BIT_MASK_PP5          (0x00000001 << BSP_GPIO_BIT_OFFSET_PP5)

#define BSP_GPIO_PORT_ID_PP6           13
#define BSP_GPIO_BASE_ADDR_PP6         GPIO_PORTP_BASE
#define BSP_GPIO_BIT_OFFSET_PP6        6
#define BSP_GPIO_BIT_MASK_PP6          (0x00000001 << BSP_GPIO_BIT_OFFSET_PP6)

#define BSP_GPIO_PORT_ID_PP7           13
#define BSP_GPIO_BASE_ADDR_PP7         GPIO_PORTP_BASE
#define BSP_GPIO_BIT_OFFSET_PP7        7
#define BSP_GPIO_BIT_MASK_PP7          (0x00000001 << BSP_GPIO_BIT_OFFSET_PP7)


/* Port Q */
#define BSP_GPIO_PORT_ID_PQ0           14
#define BSP_GPIO_BASE_ADDR_PQ0         GPIO_PORTQ_BASE
#define BSP_GPIO_BIT_OFFSET_PQ0        0
#define BSP_GPIO_BIT_MASK_PQ0          (0x00000001 << BSP_GPIO_BIT_OFFSET_PQ0)

#define BSP_GPIO_PORT_ID_PQ1           14
#define BSP_GPIO_BASE_ADDR_PQ1         GPIO_PORTQ_BASE
#define BSP_GPIO_BIT_OFFSET_PQ1        1
#define BSP_GPIO_BIT_MASK_PQ1          (0x00000001 << BSP_GPIO_BIT_OFFSET_PQ1)

#define BSP_GPIO_PORT_ID_PQ2           14
#define BSP_GPIO_BASE_ADDR_PQ2         GPIO_PORTQ_BASE
#define BSP_GPIO_BIT_OFFSET_PQ2        2
#define BSP_GPIO_BIT_MASK_PQ2          (0x00000001 << BSP_GPIO_BIT_OFFSET_PQ2)

#define BSP_GPIO_PORT_ID_PQ3           14
#define BSP_GPIO_BASE_ADDR_PQ3         GPIO_PORTQ_BASE
#define BSP_GPIO_BIT_OFFSET_PQ3        3
#define BSP_GPIO_BIT_MASK_PQ3          (0x00000001 << BSP_GPIO_BIT_OFFSET_PQ3)

#define BSP_GPIO_PORT_ID_PQ4           14
#define BSP_GPIO_BASE_ADDR_PQ4         GPIO_PORTQ_BASE
#define BSP_GPIO_BIT_OFFSET_PQ4        4
#define BSP_GPIO_BIT_MASK_PQ4          (0x00000001 << BSP_GPIO_BIT_OFFSET_PQ4)

#define BSP_GPIO_PORT_ID_PQ5           14
#define BSP_GPIO_BASE_ADDR_PQ5         GPIO_PORTQ_BASE
#define BSP_GPIO_BIT_OFFSET_PQ5        5
#define BSP_GPIO_BIT_MASK_PQ5          (0x00000001 << BSP_GPIO_BIT_OFFSET_PQ5)

#define BSP_GPIO_PORT_ID_PQ6           14
#define BSP_GPIO_BASE_ADDR_PQ6         GPIO_PORTQ_BASE
#define BSP_GPIO_BIT_OFFSET_PQ6        6
#define BSP_GPIO_BIT_MASK_PQ6          (0x00000001 << BSP_GPIO_BIT_OFFSET_PQ6)

#define BSP_GPIO_PORT_ID_PQ7           14
#define BSP_GPIO_BASE_ADDR_PQ7         GPIO_PORTQ_BASE
#define BSP_GPIO_BIT_OFFSET_PQ7        7
#define BSP_GPIO_BIT_MASK_PQ7          (0x00000001 << BSP_GPIO_BIT_OFFSET_PQ7)




/*============================================================================*/
#define BSP_GPIO_PORT_ID_A 0
#define BSP_GPIO_PORT_ID_B 1
#define BSP_GPIO_PORT_ID_C 2
#define BSP_GPIO_PORT_ID_D 3
#define BSP_GPIO_PORT_ID_E 4
#define BSP_GPIO_PORT_ID_F 5
#define BSP_GPIO_PORT_ID_G 6
#define BSP_GPIO_PORT_ID_H 7
#define BSP_GPIO_PORT_ID_J 8
#define BSP_GPIO_PORT_ID_K 9
#define BSP_GPIO_PORT_ID_L 10
#define BSP_GPIO_PORT_ID_M 11
#define BSP_GPIO_PORT_ID_N 12
#define BSP_GPIO_PORT_ID_P 13
#define BSP_GPIO_PORT_ID_Q 14
typedef uint8_t bsp_Gpio_PortId_t;

/*============================================================================*/
#define BSP_GPIO_PORT_ID_NUM_PORTS 6 // Depends on Chip version

/*============================================================================*/
#define BSP_GPIO_PIN_OFFSET_NUM_PINS_PER_PORT 8
typedef uint8_t bsp_Gpio_PinOffset_t;

/*============================================================================*/
typedef void (* bsp_Gpio_InputHandler_t)( bsp_Gpio_PortId_t    portId,
                                          bsp_Gpio_PinOffset_t pinOffset );

/*============================================================================*/
typedef struct {
    uint32_t                 baseAddr;
    uint32_t                 sysCtrlAddr;
    bsp_Interrupt_Id_t       intId;
    bool_t                   bitInterruptable;
    bsp_Gpio_InputHandler_t* handlerTable;
}bsp_Gpio_PlatformPortInfo_t;


/*==============================================================================
 *                            Public Functions
 *============================================================================*/
/*============================================================================*/
void bsp_Gpio_interruptHandlerPortA( void );
void bsp_Gpio_interruptHandlerPortB( void );
void bsp_Gpio_interruptHandlerPortC( void );
void bsp_Gpio_interruptHandlerPortD( void );
void bsp_Gpio_interruptHandlerPortE( void );
void bsp_Gpio_interruptHandlerPortF( void );
void bsp_Gpio_interruptHandlerPortG( void );
void bsp_Gpio_interruptHandlerPortH( void );
void bsp_Gpio_interruptHandlerPortJ( void );
void bsp_Gpio_interruptHandlerPortK( void );
void bsp_Gpio_interruptHandlerPortL( void );
void bsp_Gpio_interruptHandlerPortM( void );
void bsp_Gpio_interruptHandlerPortN( void );
void bsp_Gpio_interruptHandlerPortP0( void );
void bsp_Gpio_interruptHandlerPortP1( void );
void bsp_Gpio_interruptHandlerPortP2( void );
void bsp_Gpio_interruptHandlerPortP3( void );
void bsp_Gpio_interruptHandlerPortP4( void );
void bsp_Gpio_interruptHandlerPortP5( void );
void bsp_Gpio_interruptHandlerPortP6( void );
void bsp_Gpio_interruptHandlerPortP7( void );
void bsp_Gpio_interruptHandlerPortQ0( void );
void bsp_Gpio_interruptHandlerPortQ1( void );
void bsp_Gpio_interruptHandlerPortQ2( void );
void bsp_Gpio_interruptHandlerPortQ3( void );
void bsp_Gpio_interruptHandlerPortQ4( void );
void bsp_Gpio_interruptHandlerPortQ5( void );
void bsp_Gpio_interruptHandlerPortQ6( void );
void bsp_Gpio_interruptHandlerPortQ7( void );


/*==============================================================================
 *                                Globals
 *============================================================================*/

/*============================================================================*/
extern const bsp_Gpio_PlatformPortInfo_t bsp_Gpio_platformPortInfoTable[BSP_GPIO_PORT_ID_NUM_PORTS];
